<template>
    <div class="row">
        <div class="col-md-4 col-sm-12">
        <ul>
            <li v-for="(item, index) in list1"  :key="index">
            {{ item.name }}
            </li>
        </ul>
        </div>
        <div class="col-md-4 col-sm-12">
        <ul>
            <li v-for="(item, index) in list2" :key="index">
            {{ item.name }}
            </li>
        </ul>
        </div>
        <div class="col-md-4 col-sm-12">
        <ul>
            <li v-for="(item, index) in list3" :key="index">
            {{ item.name }}
            </li>
        </ul>
        </div>
    </div>  
</template>

<script>
export default {
    data(){
        return{
            list1: [
            { id: '123456789', name: '這是Done' },
            { id: '123456789', name: '圖斯特國際行銷' },
            { id: '123456789', name: '圖斯特國際行銷' },
            { id: '123456789', name: '圖斯特國際行銷' },
            { id: '123456789', name: '圖斯特國際行銷' },
            { id: '234567890', name: '台灣日通日電物流' },
            { id: '345678901', name: '台驊國際投資控股' },
            { id: '345678901', name: '台驊國際投資控股' },
            { id: '345678901', name: '台驊國際投資控股' },
            { id: '345678901', name: '台驊國際投資控股' },
            { id: '345678901', name: '台驊國際投資控股' },
            { id: '345678901', name: '台驊國際投資控股' },
            { id: '345678901', name: '台驊國際投資控股' },
            { id: '345678901', name: '台驊國際投資控股' },
            { id: '345678901', name: '台驊國際投資控股' },
            { id: '345678901', name: '台驊國際投資控股' },
            { id: '345678901', name: '台驊國際投資控股' },
            { id: '345678901', name: '台驊國際投資控股' },
            { id: '234567890', name: '台灣日通日電物流' },
            { id: '234567890', name: '台灣日通日電物流' },
            { id: '234567890', name: '台灣日通日電物流' },
            { id: '234567890', name: '台灣日通日電物流' },
            { id: '345678901', name: '台驊國際投資控股' },
            ],
            list2: [
            { id: '123456789', name: '圖斯特國際行銷' },
            { id: '123456789', name: '京揚國際' },
            { id: '123456789', name: '京揚國際' },
            { id: '123456789', name: '京揚國際' },
            { id: '123456789', name: '京揚國際' },
            { id: '234567890', name: '立揚通運' },
            { id: '345678901', name: '嘉里大榮物流' },
            { id: '345678901', name: '嘉里大榮物流' },
            { id: '345678901', name: '嘉里大榮物流' },
            { id: '345678901', name: '嘉里大榮物流' },
            { id: '345678901', name: '嘉里大榮物流' },
            { id: '345678901', name: '嘉里大榮物流' },
            { id: '345678901', name: '嘉里大榮物流' },
            { id: '345678901', name: '嘉里大榮物流' },
            { id: '345678901', name: '嘉里大榮物流' },
            { id: '345678901', name: '嘉里大榮物流' },
            { id: '345678901', name: '嘉里大榮物流' },
            { id: '345678901', name: '嘉里大榮物流' },
            { id: '234567890', name: '立揚通運' },
            { id: '234567890', name: '立揚通運' },
            { id: '234567890', name: '立揚通運' },
            { id: '234567890', name: '立揚通運' },
            { id: '345678901', name: '嘉里大榮物流' },
            ],
            list3: [
            { id: '123456789', name: '台灣聯合物流' },
            { id: '123456789', name: '台灣聯合物流' },
            { id: '123456789', name: '台灣聯合物流' },
            { id: '123456789', name: '台灣聯合物流' },
            { id: '234567890', name: '佳富物流' },
            { id: '345678901', name: '聯倉交通' },
            { id: '345678901', name: '聯倉交通' },
            { id: '345678901', name: '聯倉交通' },
            { id: '345678901', name: '聯倉交通' },
            { id: '345678901', name: '聯倉交通' },
            { id: '345678901', name: '聯倉交通' },
            { id: '345678901', name: '聯倉交通' },
            { id: '345678901', name: '聯倉交通' },
            { id: '345678901', name: '聯倉交通' },
            { id: '345678901', name: '聯倉交通' },
            { id: '345678901', name: '聯倉交通' },
            { id: '345678901', name: '聯倉交通' },
            { id: '345678901', name: '聯倉交通' },
            { id: '345678901', name: '聯倉交通' },
            { id: '345678901', name: '聯倉交通' },
            { id: '345678901', name: '聯倉交通' },
            { id: '345678901', name: '聯倉交通' },
            ],
        }
    }
}
</script>

<style>
ul li{
  list-style-type:none;
  margin: 0.5rem;
}
</style>